app/Controllers/Producto_controller.php

    public function catalogo()
{
    $productoModel = new Producto_model();

    $marca = $this->request->getGet('marca');
    $categoria = $this->request->getGet('categoria');
    $precio_max = $this->request->getGet('precio_max');

    $builder = $productoModel->builder()
        ->select('productos.*, marca.marca_nombre, categorias.categoria_nombre')
        ->join('marca', 'productos.marca_id = marca.id_marca')
        ->join('categorias', 'productos.categoria_id = categorias.id_categoria')
        ->orderBy('categorias.categoria_nombre', 'ASC')
        ->orderBy('producto_nombre', 'ASC')
        ->where('productos.producto_estado', 1); // <- este es el filtro para productos habilitados

    if (!empty($marca)) {
        $builder->like('marca.marca_nombre', $marca);
    }

    if (!empty($categoria)) {
        $builder->like('categorias.categoria_nombre', $categoria);
    }

    if (!empty($precio_max)) {
        $builder->where('productos.producto_precio <=', $precio_max);
    }

    $data['productos'] = $builder->get()->getResultArray();
    $data['marcas'] = (new Marca_model())->findAll();
    $data['categorias'] = (new Categoria_model())->orderBy('categoria_nombre', 'ASC')->findAll();
---
SELECT *
FROM `marca`
SELECT *
FROM `categorias`
SELECT `productos`.*, `marca`.`marca_nombre`, `categorias`.`categoria_nombre`
FROM `productos`
JOIN `marca` ON `productos`.`marca_id` = `marca`.`id_marca`
JOIN `categorias` ON `productos`.`categoria_id` = `categorias`.`id_categoria`
WHERE `productos`.`producto_estado` = 1
ORDER BY `categorias`.`categoria_nombre` ASC, `producto_nombre` ASC
SELECT *
FROM `categorias`
ORDER BY `categoria_nombre` ASC

    public function agregarBebida()
    {
        if (session('perfil_id') != 1) return redirect()->to('/');
        $marca = new Marca_model();
        $categoria = new Categoria_model();
        $data['marcas'] = $marca->findAll();
        $data['categorias'] = (new Categoria_model())->orderBy('categoria_nombre', 'ASC')->findAll();
---
SELECT *
FROM `marca`
SELECT *
FROM `categorias`
ORDER BY `categoria_nombre` ASC

    public function gestionarBebidas()
    {
        if (session('perfil_id') != 1) return redirect()->to('/');

        $productoModel = new \App\Models\Producto_model();
        $categoriaModel = new \App\Models\Categoria_model();

        $busqueda = $this->request->getGet('busqueda');
        $categoriaSeleccionada = $this->request->getGet('categoria');

        $productoModel
            ->select('productos.*, marca.marca_nombre, categorias.categoria_nombre')
            ->join('marca', 'productos.marca_id = marca.id_marca')
            ->join('categorias', 'productos.categoria_id = categorias.id_categoria');

        if ($busqueda) {
            $productoModel->groupStart()
                ->like('productos.producto_nombre', $busqueda)
                ->orLike('marca.marca_nombre', $busqueda)
                ->groupEnd();
        }

        if ($categoriaSeleccionada) {
            $productoModel->where('productos.categoria_id', $categoriaSeleccionada);
        }

        $productos = $productoModel->findAll();
        $categorias = $categoriaModel->orderBy('categoria_nombre', 'ASC')->findAll();
---
SELECT *
FROM `categorias`
ORDER BY `categoria_nombre` ASC
SELECT `productos`.*, `marca`.`marca_nombre`, `categorias`.`categoria_nombre`
FROM `productos`
JOIN `marca` ON `productos`.`marca_id` = `marca`.`id_marca`
JOIN `categorias` ON `productos`.`categoria_id` = `categorias`.`id_categoria`

    public function actualizarBebida($id)
    {
        helper(['form', 'url']);
        if (session('perfil_id') != 1) return redirect()->to('/');
        $productoModel = new \App\Models\Producto_model();

        $producto = $productoModel->find($id);
        if (!$producto) {
            return redirect()->to('listar_bebidas')->with('mensaje', 'Producto no encontrado.');
---
SELECT `productos`.*, `marca`.`marca_nombre`, `categorias`.`categoria_nombre`
FROM `productos`
JOIN `marca` ON `productos`.`marca_id` = `marca`.`id_marca`
JOIN `categorias` ON `productos`.`categoria_id` = `categorias`.`id_categoria`