app/Controllers/Usuario_controller.php

SELECT *
FROM `usuarios`
WHERE `email` = 'santiasselborn1@gmail.com'
 LIMIT 1
---
    public function login()
{
    $validation = \Config\Services::validation();
    $request = \Config\Services::request();

    $validation->setRules([
        'email' => 'required|valid_email',
        'password' => 'required'
    ], [
        'email' => [
            'required' => 'El correo electrónico es obligatorio',
            'valid_email' => 'Debe ingresar un correo válido'
        ],
        'password' => [
            'required' => 'La contraseña es obligatoria'
        ]
    ]);

    if (!$validation->withRequest($request)->run()) {
        return view('layout/navbar').view('login', [
            'validation' => $validation
        ]).view('layout/footer');
    }

    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $usuarioModel = new \App\Models\Usuario_model();
    $usuario = $usuarioModel->where('email', $email)->first();

SELECT *
FROM `usuarios`
WHERE `usuario` = 'robertocarlos'
AND `id_usuario` != '13'
 LIMIT 1
---
        if ($validation->withRequest($request)->run()) {

            // Verificar si el usuario ya existe
            $existeUsuario = $usuarioModel->where('usuario', $usuario)
                                          ->where('id_usuario !=', $id_usuario)
                                          ->first();

SELECT *
FROM `usuarios`
WHERE `email` = 'robertocarlos@gmail.com'
AND `id_usuario` != '13'
 LIMIT 1
---
                    .view('layout/footer');
            }

            $existeEmail = $usuarioModel->where('email', $email)
                                        ->where('id_usuario !=', $id_usuario)
                                        ->first();

UPDATE `usuarios` SET `nombre` = 'Roberto', `apellido` = 'Carlos', `usuario` = 'robertocarlos', `email` = 'robertocarlos@gmail.com'
WHERE `usuarios`.`id_usuario` IN ('13')
---
                $datosActualizar['pass'] = password_hash($pass, PASSWORD_DEFAULT);
            }

            $usuarioModel->update($id_usuario, $datosActualizar);