app/Controllers/Usuario_controller.php

    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuarioModel = new \App\Models\Usuario_model();
        $usuario = $usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'capocarbo@gmail.com'
 LIMIT 1